meeting/minutes/2022/09-13.org
:PROPERTIES:
:ID:       B2D82C22-B9FF-48B0-B58D-7693D844D1C3
:END:
#+title: QT4 CG Meeting 002 Minutes 2022-09-13
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/notes.css"/>
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showeverything

* Minutes
:PROPERTIES:
:unnumbered: t
:END:

Approved on [[./09-20.html#approve-minutes][20 September]].

** Summary of new and continuing actions [0/9]
:PROPERTIES:
:unnumbered: t
:END:

+ [ ] QT4CG-002-01: NW to incorporate email feedback and produce new
  versions of the process documents.
+ [ ] QT4CG-002-02: RD to make a traige pass over the issues.
+ [ ] QT4CG-002-03: NW to setup the GitHub labels as discussed in email.
+ [ ] QT4CG-002-04: MK to add DN’s “op” function to the list.
+ [ ] QT4CG-002-05: EP to make links from the GitHub README files to
  the formatted specs.
+ [ ] QT4CG-002-06: DN to make a GitHub issue to track the question of
  whether we need array versions of all functions that take sequences.
+ [ ] QT4CG-002-07: MK to make a pull request incorporating the
  changes to fn:all.
+ [ ] QT4CG-002-08: NW to investigate automatically generating
  formatted specs from pull requests.
+ [ ] QT4CG-002-09: MK to make a pull request incorporating the
  changes to fn:some.

* Administrivia

** Roll call [10/10]

+ [X] Anthony Bufort (AB)
+ [X] Reece Dunn (RD)
+ [X] Joel Kalvesmaki (JK) [x:35-]
+ [X] Michael Kay (MK)
+ [X] John Lumley (JL)
+ [X] Dimitre Novatchev (DN)
+ [X] Ed Porter (EP)
+ [X] C. M. Sperberg-McQueen (CSM)
+ [X] Bethan Tovey-Walsh (BTW)
+ [X] Norm Tovey-Walsh (NW)

** Agenda

Agenda: [[../../agenda/2022/09-13.html][https://qt4cg.org/meeting/agenda/2022/09-13.html]]

+ NW: I’d like to add a brief discussion about the labels.

Proposal: Accept the agenda as amended?

No objections.

** Approve minutes of the previous meeting

Minutes of the previous meeting:  https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0003.html

Proposal: Accept the minutes as posted.

No objections.

** Appoint chair and scribe for meeting

+ NW volunteers, no objections.
  + Accepted

** Process and plan

+ NW: We talked about the process-y documents a lot last week, and
  then in email. I’ll try to incorporate that feedback and see if
  we’re all happy with the results.
  + Does anyone want to talk about them more this week?

No one proposes to.

ACTION QT4CG-002-01: NW to incorporate email feedback and produce
                                               new versions of the process documents.

+ MK: We talked about process, but we didn’t talk a lot about plan.
  + … do we start breadth first, by doing a plan and a requirements
  document, or do we start depth first with some low hanging fruit
  before doing a more breadth first view.
+ JL: I agree with the implication that MK made last week that
  actually getting some purchase by doing a little bit would be good.
+ DN: In regards to ordering the items, it would be a good idea to
  make some kind of dependency graph. Don’t discuss things out of
  order.
+ NW: Are you volunterring?
+ DN: Maybe we should traige the lists first
+ MK: Noting dependcies is part of that triage process
+ NW: Volunteers?
+ RD: I’ll take a pass.

ACTION QT4CG-002-02: RD to make a traige pass over the issues.

Some discussion of labels and who can assign them.

+ DN: Because we’re looking for people to scan for dependencies, the
  person who made the proposal should also review the items they
  proposed.

+ NW: Good. We’ll review that in the future.

*** GitHub labels

+ NW: I thought what came out of the email discussion was really good.
  I suggest we adopt that for the time being, we can always change it
  as we go.

ACTION QT4CG-002-03: NW to setup the GitHub labels as discussed in email.

** Appointment of permanent co-chairs and editor

+ NW: DN proposed that having a co-chair would look better. He
  suggested CSM and CSM has agreed.
+ CSM: I’m committing to co-chair for the next year, I plan to review
  my commitments in a year and see where we are.
  + … the CG should probably do that too!
+ NW: I agree

Proposal: CSM and NW to co-chair.

No objections.

** Diversity

+ BT: Are we going to do anything to try to encourage diversity?
+ CSM: Is there anything we can do?
+ BT: We can work out what we can do if the CG is willing to make a
  commitment to try to encourage diversity.
+ DN: I don’t understand what’s being suggested.
+ BT: I think we should begin by making a commitment that we are
  willing to try to increase the diversity of the group. I think it’s
  hard to work out what we should do.
  + …If I weren’t married to one of this group, I wouldn’t be here
    because I wouldn’t feel fully comforable looking at this group. I
    wouldn’t feel like this is a place for me. I’m the only woman in
    this group and in the other CG I participate in.
+ NW: I think diversity would be good!

Proposal: The CG agrees that we should work to encourage diversity in
the group.

No objections.

+ AB: I’d like to thank Bethan for a really gutsy and straight-foward
presentation of the problem. I’m a newcomer and I feel somewhat
intimidated by these meetings. It’s hard to overcome my introversion.
I volunteer to join BT to figure out what we can do. I already have
some ideas.

+ NW: Thank you. And thank you for being here. 

