meeting/minutes/2022/09-13.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 002 Minutes 2022-09-13</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/meeting/css/notes.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 002 Minutes 2022-09-13</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org10cb182">Minutes</a>
<ul>
<li><a href="#org6e289c1">Summary of new and continuing actions <code>[0/9]</code></a></li>
</ul>
</li>
<li><a href="#org42937dd">1. Administrivia</a>
<ul>
<li><a href="#orgf0b0850">1.1. Roll call <code>[10/10]</code></a></li>
<li><a href="#orgcedd931">1.2. Agenda</a></li>
<li><a href="#org3222d55">1.3. Approve minutes of the previous meeting</a></li>
<li><a href="#org9673c54">1.4. Appoint chair and scribe for meeting</a></li>
<li><a href="#orgfe9b5c6">1.5. Process and plan</a>
<ul>
<li><a href="#orge5b0e84">1.5.1. GitHub labels</a></li>
</ul>
</li>
<li><a href="#org941f2aa">1.6. Appointment of permanent co-chairs and editor</a></li>
<li><a href="#org4655b58">1.7. Diversity</a></li>
</ul>
</li>
<li><a href="#orge2f6244">2. Technical Agenda</a>
<ul>
<li><a href="#org89a41cb">2.1. XPath 4.0 functions</a>
<ul>
<li><a href="#orgfc3baef">2.1.1. fn:all</a></li>
<li><a href="#org0d8eb37">2.1.2. fn:some</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0828cd4">3. Any other business</a></li>
<li><a href="#orge07f2d9">4. Adjourned</a></li>
</ul>
</div>
</div>

<div id="outline-container-org10cb182" class="outline-2">
<h2 id="org10cb182">Minutes</h2>
<div class="outline-text-2" id="text-org10cb182">
<p>
Approved on <a href="./09-20.html#approve-minutes">20 September</a>.
</p>
</div>

<div id="outline-container-org6e289c1" class="outline-3">
<h3 id="org6e289c1">Summary of new and continuing actions <code>[0/9]</code></h3>
<div class="outline-text-3" id="text-org6e289c1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-01: NW to incorporate email feedback and produce new
versions of the process documents.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-002-02: RD to make a traige pass over the issues.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-002-03: NW to setup the GitHub labels as discussed in email.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-002-04: MK to add DN’s “op” function to the list.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-002-05: EP to make links from the GitHub README files to
the formatted specs.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-002-06: DN to make a GitHub issue to track the question of
whether we need array versions of all functions that take sequences.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-002-07: MK to make a pull request incorporating the
changes to fn:all.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-002-08: NW to investigate automatically generating
formatted specs from pull requests.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-002-09: MK to make a pull request incorporating the
changes to fn:some.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org42937dd" class="outline-2">
<h2 id="org42937dd"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf0b0850" class="outline-3">
<h3 id="orgf0b0850"><span class="section-number-3">1.1.</span> Roll call <code>[10/10]</code></h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Anthony Bufort (AB)</li>
<li class="on"><code>[X]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK) [x:35-]</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> John Lumley (JL)</li>
<li class="on"><code>[X]</code> Dimitre Novatchev (DN)</li>
<li class="on"><code>[X]</code> Ed Porter (EP)</li>
<li class="on"><code>[X]</code> C. M. Sperberg-McQueen (CSM)</li>
<li class="on"><code>[X]</code> Bethan Tovey-Walsh (BTW)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW)</li>
</ul>
</div>
</div>

<div id="outline-container-orgcedd931" class="outline-3">
<h3 id="orgcedd931"><span class="section-number-3">1.2.</span> Agenda</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Agenda: <a href="../../agenda/2022/09-13.html">https://qt4cg.org/meeting/agenda/2022/09-13.html</a>
</p>

<ul class="org-ul">
<li>NW: I’d like to add a brief discussion about the labels.</li>
</ul>

<p>
Proposal: Accept the agenda as amended?
</p>

<p>
No objections.
</p>
</div>
</div>

<div id="outline-container-org3222d55" class="outline-3">
<h3 id="org3222d55"><span class="section-number-3">1.3.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Minutes of the previous meeting:  <a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0003.html">https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0003.html</a>
</p>

<p>
Proposal: Accept the minutes as posted.
</p>

<p>
No objections.
</p>
</div>
</div>

<div id="outline-container-org9673c54" class="outline-3">
<h3 id="org9673c54"><span class="section-number-3">1.4.</span> Appoint chair and scribe for meeting</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>NW volunteers, no objections.
<ul class="org-ul">
<li>Accepted</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgfe9b5c6" class="outline-3">
<h3 id="orgfe9b5c6"><span class="section-number-3">1.5.</span> Process and plan</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>NW: We talked about the process-y documents a lot last week, and
then in email. I’ll try to incorporate that feedback and see if
we’re all happy with the results.
<ul class="org-ul">
<li>Does anyone want to talk about them more this week?</li>
</ul></li>
</ul>

<p>
No one proposes to.
</p>

<p>
ACTION QT4CG-002-01: NW to incorporate email feedback and produce
                                               new versions of the process documents.
</p>

<ul class="org-ul">
<li><p>
MK: We talked about process, but we didn’t talk a lot about plan.
</p>
<ul class="org-ul">
<li>… do we start breadth first, by doing a plan and a requirements</li>
</ul>
<p>
document, or do we start depth first with some low hanging fruit
before doing a more breadth first view.
</p></li>
<li>JL: I agree with the implication that MK made last week that
actually getting some purchase by doing a little bit would be good.</li>
<li>DN: In regards to ordering the items, it would be a good idea to
make some kind of dependency graph. Don’t discuss things out of
order.</li>
<li>NW: Are you volunterring?</li>
<li>DN: Maybe we should traige the lists first</li>
<li>MK: Noting dependcies is part of that triage process</li>
<li>NW: Volunteers?</li>
<li>RD: I’ll take a pass.</li>
</ul>

<p>
ACTION QT4CG-002-02: RD to make a traige pass over the issues.
</p>

<p>
Some discussion of labels and who can assign them.
</p>

<ul class="org-ul">
<li>DN: Because we’re looking for people to scan for dependencies, the
person who made the proposal should also review the items they
proposed.</li>

<li>NW: Good. We’ll review that in the future.</li>
</ul>
</div>

<div id="outline-container-orge5b0e84" class="outline-4">
<h4 id="orge5b0e84"><span class="section-number-4">1.5.1.</span> GitHub labels</h4>
<div class="outline-text-4" id="text-1-5-1">
<ul class="org-ul">
<li>NW: I thought what came out of the email discussion was really good.
I suggest we adopt that for the time being, we can always change it
as we go.</li>
</ul>

<p>
ACTION QT4CG-002-03: NW to setup the GitHub labels as discussed in email.
</p>
</div>
</div>
</div>

<div id="outline-container-org941f2aa" class="outline-3">
<h3 id="org941f2aa"><span class="section-number-3">1.6.</span> Appointment of permanent co-chairs and editor</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>NW: DN proposed that having a co-chair would look better. He
suggested CSM and CSM has agreed.</li>
<li>CSM: I’m committing to co-chair for the next year, I plan to review
my commitments in a year and see where we are.
<ul class="org-ul">
<li>… the CG should probably do that too!</li>
</ul></li>
<li>NW: I agree</li>
</ul>

<p>
Proposal: CSM and NW to co-chair.
</p>

<p>
No objections.
</p>
</div>
</div>

<div id="outline-container-org4655b58" class="outline-3">
<h3 id="org4655b58"><span class="section-number-3">1.7.</span> Diversity</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>BT: Are we going to do anything to try to encourage diversity?</li>
<li>CSM: Is there anything we can do?</li>
<li>BT: We can work out what we can do if the CG is willing to make a
commitment to try to encourage diversity.</li>
<li>DN: I don’t understand what’s being suggested.</li>
<li>BT: I think we should begin by making a commitment that we are
willing to try to increase the diversity of the group. I think it’s
hard to work out what we should do.
<ul class="org-ul">
<li>…If I weren’t married to one of this group, I wouldn’t be here
because I wouldn’t feel fully comforable looking at this group. I
wouldn’t feel like this is a place for me. I’m the only woman in
this group and in the other CG I participate in.</li>
</ul></li>
<li>NW: I think diversity would be good!</li>
</ul>

<p>
Proposal: The CG agrees that we should work to encourage diversity in
the group.
</p>

<p>
No objections.
</p>

<ul class="org-ul">
<li>AB: I’d like to thank Bethan for a really gutsy and straight-foward</li>
</ul>
<p>
presentation of the problem. I’m a newcomer and I feel somewhat
intimidated by these meetings. It’s hard to overcome my introversion.
I volunteer to join BT to figure out what we can do. I already have
some ideas.
</p>

<ul class="org-ul">
<li>NW: Thank you. And thank you for being here.</li>
</ul>
</div>
</div>
</div>
