meeting/minutes/2022/09-13.html

<div id="outline-container-orge2f6244" class="outline-2">
<h2 id="orge2f6244"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org89a41cb" class="outline-3">
<h3 id="org89a41cb"><span class="section-number-3">2.1.</span> XPath 4.0 functions</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/blob/master/editorial/functions-checklist.pdf">https://github.com/qt4cg/qtspecs/blob/master/editorial/functions-checklist.pdf</a></li>
</ul>
<ul class="org-ul">
<li>NW: What was your plan for this document, MK?</li>
</ul>

<p>
MK shares his screen to review the document.
</p>

<ul class="org-ul">
<li>MK: What I did was to start by listing the functions that either
were either already in the draft spec from 18 months ago, or were in
the issues list.
<ul class="org-ul">
<li>… It was a trawl through to find the functions that we have.</li>
<li>… The “usefulness” metric is more-or-less just gut feeling.</li>
<li>… Completeness is a little more objective</li>
<li>… Tests indicates where we have tests and some idea of completness</li>
</ul></li>

<li>MK: My feeling is to start by taking that first list and see if we
can approve them for incorporation in the spec.</li>
<li>DN: What about things that are missing?</li>
<li>MK: Let’s focus on what’s on the list first.</li>
</ul>

<p>
Some discussion of what the current state is. These functions are in
the specification but this group hasn’t adopted the specs as a baseline.
</p>

<p>
Some discussion of the missing function that DN was referring to.
</p>

<p>
ACTION QT4CG-002-04: MK to add DN’s “op” function to the list.
</p>

<ul class="org-ul">
<li>MK: I propose we go through them one at a time and see which ones we
can approve.</li>
</ul>

<p>
Some discussion of where the specs are. The formatted specs are at
qt4cg.org, not directly in the repo.
</p>

<p>
ACTION QT4CG-002-05: EP to make links from the GitHub README files to
the formatted specs.
</p>
</div>

<div id="outline-container-orgfc3baef" class="outline-4">
<h4 id="orgfc3baef"><span class="section-number-4">2.1.1.</span> fn:all</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>MK: I think there should be two signatures.</li>
<li>RD: Doesn’t the second example need to be fn:boolean#1?</li>
<li>MK: Yes. Thank you.</li>
<li>MK: The same logic applies to the first one which I was struggling with.</li>
<li>CSM: Question: am I right to think this is extensionally equivalent to  every $i in input…</li>
<li>MK: That’s what the rule says (…points to the rule in the spec…).
<ul class="org-ul">
<li>CSM: I missed it. I propose that the rule should be a code block, not inline code!</li>
</ul></li>
<li>CSM: This is just syntactic sugar for brevity?</li>
<li>MK: Not just for brevity. In a world of higher order functions, it
becomes useful to have functionality encapsulated in a function. You
can use this as an argument to array-filter, for example.</li>
<li>CSM: Now I’m puzzled by the signature returns xs:integer</li>
</ul>

<p>
Agreement that it should return xs:boolean.
</p>

<ul class="org-ul">
<li>DN: Maybe it would be good if there is a function like this for arrays.</li>
<li>MK: Yes, as a general issue, should we have array functions
corresponding to every sequence function.</li>
<li>DN: I think it would be good so we don’t have to explain the distinction.</li>
</ul>

<p>
ACTION QT4CG-002-06: DN to make a GitHub issue to track the question
of whether we need array versions of all functions that take
sequences.
</p>

<p>
Some discusssion of what namespace these are in.
</p>

<ul class="org-ul">
<li>MK: I’ve used a bit of syntax in the examples that we haven’t
approved yet. That might be a bad idea.</li>
<li>RD: I think it’s fine to keep it for now, if the syntax changes,
we’ll have to fix the examples.</li>
</ul>

<p>
Proposal: add fn:all to the consensus draft?
</p>

<p>
No objections.
</p>

<p>
ACTION QT4CG-002-07: MK to make a pull request incorporating the
changes to fn:all.
</p>

<p>
ACTION QT4CG-002-08: NW to investigate automatically generating
formatted specs from pull requests.
</p>
</div>
</div>

<div id="outline-container-org0d8eb37" class="outline-4">
<h4 id="org0d8eb37"><span class="section-number-4">2.1.2.</span> fn:some</h4>
<div class="outline-text-4" id="text-2-1-2">
<ul class="org-ul">
<li>MK: This is very similar to fn:all</li>

<li>DN: Are we going to provide implementation hints?</li>
<li>MK: I think those are general rules.
<ul class="org-ul">
<li>We do often provide a sample implementation in XQuery or XSLT or both.</li>
</ul></li>
<li>NW: Are we going to try to do that for all the functions, or only where it provides extra clarity?</li>
<li>MK: I think we’ve tended to do it where it adds clarity.</li>
<li>DN: I think this would contribute to the clarity.</li>
<li>CSM: If I understand correctly, DN is suggesting that we have code
not to clarify the semantics of the function, which are given fairly
explicilty by the rule, but to clarify that an implementation is
allowed to short circuit the evaluation?</li>
<li>DN: No, those are two separate things.</li>
<li>JL: In both these examples, we have exactly that in the rule. You
could write this yourself if you were allowed to write a function in
the fn: namespace.
<ul class="org-ul">
<li>What is of interest to me is what happens if you have an error later on.</li>
</ul></li>
<li>MK: Error handling is defined by general rules for XPath. We don’t
like them, they’re horrible, but they exist!</li>
<li>DN: One more benefit is that it would ease testing. It can serve as
an oracle for testing.</li>
<li>NW: Can we try it out and see what we think?</li>
</ul>

<p>
The scribe missed some description of what a potential implementation
might look like, for fn:all?
</p>

<ul class="org-ul">
<li>MK: The danger of providing a recursive implementation is that it
would appear to invalidate a parallel implementation. It would have
to be non-normative.</li>
<li>NW: Right, so the examples are sometimes more confusing.</li>
<li>CSM: I put this in chat:
  function($input, $predicate) as xs:boolean { every &#x2026; }
anything beyond that?</li>
<li>DN: I don’t understand what you’ve written.</li>
<li>CSM: If you asked me for a sample implementation, I’d write what
I’ve given above.</li>
<li>DN: Yes.</li>
<li>CSM: So the question in my mind is, is that all you wanted? I’d be
happy with the rules as they are, but if the point of this is how to
get from an expression to a function would work. In that case, it
could be normative.
<ul class="org-ul">
<li>I take MK’s point, you don’t want to make the sample/reference
implementation more specific than it should be.</li>
</ul></li>
<li>DN: We just provide one implementation, we will not say that it is
the normative implementations.</li>
<li>MK: The constraints on error behavior can also be different.</li>
<li>DN: In any case, I think it’s preferable to have it.</li>
<li>RD: I was going to say in this case where it’s trivial, I don’t
think adding an implementation adds clarity. But it would make sense
in more complicated.</li>
<li>NW: I think that comes back to my question earlier, it makes more
sense when the functions are complicated. And DN is right, if the
example implementation is too complicated that’s going to help us
understand that maybe we’ve specified the function poorly.</li>
<li>MK: I’d forgotten that there are cases where we define it
normatively. I have no objection to using the same style.</li>
<li>EP: Yes, we’re almost there in the rules. The spec is in the rule,
we’d just have to wrap it in function and we’d be done.</li>
<li>AB: Doing it for examples where it’s complicated makes more sense to
me than doing it all the time.</li>
<li>BT: There’s one argument for doing for everything where you think
it’s very simple but the explanation makes you think maybe it’s more
complicated.</li>
<li>MK: You can’t give example implementations for all functions.</li>
<li>NW: Let’s go with adding them when it adds clarity.</li>
<li>MK: I’ll try to use the spec style and we can</li>
</ul>

<p>
Proposal: add fn:some to the consensus draft?
</p>

<p>
No objections.
</p>

<p>
ACTION QT4CG-002-09: MK to make a pull request incorporating the
changes to fn:some.
</p>
</div>
</div>
</div>
</div>
