meeting/minutes/2022/09-13.org
* Any other business

Brief discussion of process and voting.

+ NW: With respect to voting, I’d rather not. My preferred style is to
  ask if there are any objections. If there aren’t any, we can move
  on. If there are, we have more discussion.
  + If we get to vote counting, you’ve really backed me into a corner!

* Adjourned
