meeting/minutes/2022/09-13.html

<div id="outline-container-org0828cd4" class="outline-2">
<h2 id="org0828cd4"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-3">
<p>
Brief discussion of process and voting.
</p>

<ul class="org-ul">
<li>NW: With respect to voting, I’d rather not. My preferred style is to
ask if there are any objections. If there aren’t any, we can move
on. If there are, we have more discussion.
<ul class="org-ul">
<li>If we get to vote counting, you’ve really backed me into a corner!</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge07f2d9" class="outline-2">
<h2 id="orge07f2d9"><span class="section-number-2">4.</span> Adjourned</h2>
</div>
</div>
</body>
</html>
